import { Inject, Instance, Router, Route } from "../../../../core/tools/decorator";
import { UserService } from "../service/userservice";
import { BaseRoute } from "../../../../core/main/route/baseroute";
import { DataImpl } from "../service/dataimpl";

/**
 * 测试用户
 */
@Router({
    namespace:'/commodity',
    path:'/'
})

class CommodityAction extends BaseRoute{
    
    getinfo(params){
        let pageno = params.pageno;
        let pagesize = params.pagesize;
        if(!pageno || !pagesize){
            // pageno = 1;
            // pagesize = 10;
            return;
        }else{
            if(pageno){
                pageno = parseInt(pageno);
            }
            if(pagesize){
                pagesize = parseInt(pagesize);
            }
        }
        
        let index = (pageno-1) * pagesize;
        return {
            "vip":0.9,
            "total":33,
            "rows":[
                {"id":index+1,"name":"女款韩版休闲圆领宽松运动风条纹撞色短袖连衣裙","price":46,"oprice":399,"discount":0.12,"head":"imgs/1.jpg","desc":"女款韩版休闲圆领宽松运动风条纹撞色短袖连衣裙女款韩版休闲圆领宽松运动风条纹撞色短袖连衣裙女款韩版休闲圆领宽松运动风条纹撞色短袖连衣裙女款韩版休闲圆领宽松运动风条纹撞色短袖连衣裙"},
                {"id":index+2,"name":"夏季新款韩版时尚气质蝴蝶结圆领收腰连衣裙夏连衣裙女裙子","price":44,"oprice":478,"discount":0.09,"head":"imgs/2.jpg","desc":"夏季新款韩版时尚气质蝴蝶结圆领收腰连衣裙夏连衣裙女裙子夏季新款韩版时尚气质蝴蝶结圆领收腰连衣裙夏连衣裙女裙子夏季新款韩版时尚气质蝴蝶结圆领收腰连衣裙夏连衣裙女裙子夏季新款韩版时尚气质蝴蝶结圆领收腰连衣裙夏连衣裙女裙子"},
                {"id":index+3,"name":"夏新款显瘦仙女圆领直筒修身短袖女士时尚连衣裙","price":56,"oprice":499,"discount":0.12,"head":"imgs/3.jpg","desc":"夏新款显瘦仙女圆领直筒修身短袖女士时尚连衣裙夏新款显瘦仙女圆领直筒修身短袖女士时尚连衣裙夏新款显瘦仙女圆领直筒修身短袖女士时尚连衣裙夏新款显瘦仙女圆领直筒修身短袖女士时尚连衣裙"},
                {"id":index+4,"name":"2020可甜可盐系穿搭复古衬衫格子拼接假两件连衣裙气质收腰裙子","price":46,"oprice":399,"discount":0.12,"head":"imgs/4.jpg","desc":"2020可甜可盐系穿搭复古衬衫格子拼接假两件连衣裙气质收腰裙子2020可甜可盐系穿搭复古衬衫格子拼接假两件连衣裙气质收腰裙子2020可甜可盐系穿搭复古衬衫格子拼接假两件连衣裙气质收腰裙子2020可甜可盐系穿搭复古衬衫格子拼接假两件连衣裙气质收腰裙子"},
                {"id":index+5,"name":"【春装连衣裙】个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙","price":59,"oprice":668,"discount":0.09,"head":"imgs/5.jpg","desc":"【春装连衣裙】个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙【春装连衣裙】个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙【春装连衣裙】个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙"},
                {"id":index+6,"name":"2020夏装新款气质红色露肩宽松休闲遮肉女士连衣裙","price":95,"oprice":519,"discount":0.18,"head":"imgs/6.jpg","desc":"2020夏装新款气质红色露肩宽松休闲遮肉女士连衣裙2020夏装新款气质红色露肩宽松休闲遮肉女士连衣裙2020夏装新款气质红色露肩宽松休闲遮肉女士连衣裙2020夏装新款气质红色露肩宽松休闲遮肉女士连衣裙"},
                {"id":index+7,"name":"【2020夏装新款】女时尚森系V领修身桔梗法式雪纺连衣裙","price":168,"oprice":798,"discount":0.22,"head":"imgs/7.jpg","desc":"【2020夏装新款】女时尚森系V领修身桔梗法式雪纺连衣裙【2020夏装新款】女时尚森系V领修身桔梗法式雪纺连衣裙【2020夏装新款】女时尚森系V领修身桔梗法式雪纺连衣裙【2020夏装新款】女时尚森系V领修身桔梗法式雪纺连衣裙"},
                {"id":index+8,"name":"七格格泡泡袖连衣裙女2020夏季新款宽松设计感可盐可甜裙子","price":149,"oprice":529,"discount":0.29,"head":"imgs/8.jpg","desc":"七格格泡泡袖连衣裙女2020夏季新款宽松设计感可盐可甜裙子七格格泡泡袖连衣裙女2020夏季新款宽松设计感可盐可甜裙子七格格泡泡袖连衣裙女2020夏季新款宽松设计感可盐可甜裙子七格格泡泡袖连衣裙女2020夏季新款宽松设计感可盐可甜裙子七格格泡泡袖连衣裙女2020夏季新款宽松设计感可盐可甜裙子七格格泡泡袖连衣裙女2020夏季新款宽松设计感可盐可甜裙子"},
                {"id":index+9,"name":"2020夏季气质雪纺中长裙沙滩裙子中长款性感V领喇叭袖连衣裙女1099","price":66,"oprice":269,"discount":0.25,"head":"imgs/9.jpg","desc":"2020夏季气质雪纺中长裙沙滩裙子中长款性感V领喇叭袖连衣裙女10992020夏季气质雪纺中长裙沙滩裙子中长款性感V领喇叭袖连衣裙女10992020夏季气质雪纺中长裙沙滩裙子中长款性感V领喇叭袖连衣裙女10992020夏季气质雪纺中长裙沙滩裙子中长款性感V领喇叭袖连衣裙女10992020夏季气质雪纺中长裙沙滩裙子中长款性感V领喇叭袖连衣裙女1099"},
                {"id":index+10,"name":"夏季新品波点v领雪纺连衣裙女收腰显瘦女士连衣裙夏女","price":79,"oprice":979,"discount":0.09,"head":"imgs/10.jpg","desc":"夏季新品波点v领雪纺连衣裙女收腰显瘦女士连衣裙夏女夏季新品波点v领雪纺连衣裙女收腰显瘦女士连衣裙夏女夏季新品波点v领雪纺连衣裙女收腰显瘦女士连衣裙夏女夏季新品波点v领雪纺连衣裙女收腰显瘦女士连衣裙夏女夏季新品波点v领雪纺连衣裙女收腰显瘦女士连衣裙夏女"},
                {"id":index+11,"name":"2020可甜可盐系穿搭复古衬衫格子拼接假两件连衣裙气质收腰裙子","price":46,"oprice":399,"discount":0.12,"head":"imgs/4.jpg","desc":"2020可甜可盐系穿搭复古衬衫格子拼接假两件连衣裙气质收腰裙子2020可甜可盐系穿搭复古衬衫格子拼接假两件连衣裙气质收腰裙子2020可甜可盐系穿搭复古衬衫格子拼接假两件连衣裙气质收腰裙子2020可甜可盐系穿搭复古衬衫格子拼接假两件连衣裙气质收腰裙子"},
                {"id":index+12,"name":"【春装连衣裙】个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙","price":59,"oprice":668,"discount":0.09,"head":"imgs/5.jpg","desc":"【春装连衣裙】个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙【春装连衣裙】个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙【春装连衣裙】个性纯色舒适显瘦气质复古百褶束腰设计款简约长裙"},
                {"id":index+13,"name":"2020夏装新款气质红色露肩宽松休闲遮肉女士连衣裙","price":95,"oprice":519,"discount":0.18,"head":"imgs/6.jpg","desc":"2020夏装新款气质红色露肩宽松休闲遮肉女士连衣裙2020夏装新款气质红色露肩宽松休闲遮肉女士连衣裙2020夏装新款气质红色露肩宽松休闲遮肉女士连衣裙2020夏装新款气质红色露肩宽松休闲遮肉女士连衣裙"},
              ]
        }
    }

    
}

export {CommodityAction};